# StairsTrisertypeRiserMaterial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeRiserMaterial Property
ParameterTypeId Class See Also
---
"Riser Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeRiserMaterial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeRiserMaterial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeRiserMaterial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace